IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSIRX5_CFG.xml
	<register id="CFG_Reserved_10" acronym="CFG_Reserved_10" offset="0x54" width="16" description="">
		
	</register>
	<register id="CFG_RX_DLYLINE_CTRL" acronym="CFG_RX_DLYLINE_CTRL" offset="0x60" width="16" description="Receive delay line control register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="RXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for RXD1This bitfield selects the number of delay elements inserted into the RXD1 path from the pin boundary to the receiver core. 0h [R/W] Zero delay elements are included in the RXD1 path. RXD1 is taken directly from the pin.1h [R/W] One delay element is included in the RXD1 path.2h [R/W] Two delay elements are included in the RXD1 path....1Fh [R/W] 31 delay elements are included in the RXD1 path, the maximum." range="14 - 10" rwaccess="R/W"/> 
		<bitfield id="RXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for RXD0This bitfield selects the number of delay elements inserted into the RXD0 path from the pin boundary to the receiver core. 0h [R/W] Zero delay elements are included in the RXD0 path. RXD0 is taken directly from the pin.1h [R/W] One delay element is included in the RXD0 path.2h [R/W] Two delay elements are included in the RXD0 path....1Fh [R/W] 31 delay elements are included in the RXD0 path, the maximum." range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="RXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for RXCLKThis bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core. 0h [R/W] Zero delay elements are included in the RXCLK path. RXCLK is taken directly from the pin.1h [R/W] One delay element is included in the RXCLK path.2h [R/W] Two delay elements are included in the RXCLK path....1Fh [R/W] 31 delay elements are included in the RXCLK path, the maximum." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_11" acronym="CFG_Reserved_11" offset="0x62" width="16" description="">
		
	</register>
	<register id="CFG_RX_VIS_1" acronym="CFG_RX_VIS_1" offset="0x70" width="32" description="Receive debug visibility register 1">
		<bitfield id="RX_CORE_STS" width="1" begin="3" end="3" resetval="0x0" description="Receiver Core Status bitThis bit indicates the status of the receiver core. If this bit is set, the receiver should undergo a reset and subsequent resynchronization with the transmitter. This bit will be always be set when the receiver has detected and end of frame error or a frame type error. This bit can also be set if the receiver becomes corrupted due to noise on the signal lines. If the receiver has experienced a ping watchdog or frame watchdog timeout, this bit should be read to determine if the cause was due to a corrupt transaction, thus putting the receiver core into an unrecoverable state. Only a soft reset will reset the recevier core and thus reset this bit. 0h [R] The receiver core is operating normally.1h [R] The receiver core has entered into an error state and should be reset." range="3" rwaccess="R"/>
	</register>
	<register id="CFG_Reserved_12" acronym="CFG_Reserved_12" offset="0x74" width="16" description="">
		
	</register>
	<register id="CFG_RX_BUF_BASE" acronym="CFG_RX_BUF_BASE" offset="0x80" width="16" description="Base address for receive data buffer">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Receive Data Buffer Base AddressThis is the base address of the 16-word data buffer used by the receiver." range="15 - 0" rwaccess="R"/>
	</register>
</module>